require 'pry'
require 'colorize'
class Player

  attr_accessor :name, :wallet

  def initialize
    @name = name
    @wallet = wallet
  end

  def welcome
  
    welcome_screen = <<MENU 


 ÛÛÛÛÛ   ÛÛÛ   ÛÛÛÛÛ          ÛÛÛÛ                                            
°°ÛÛÛ   °ÛÛÛ  °°ÛÛÛ          °°ÛÛÛ                                            
 °ÛÛÛ   °ÛÛÛ   °ÛÛÛ   ÛÛÛÛÛÛ  °ÛÛÛ   ÛÛÛÛÛÛ   ÛÛÛÛÛÛ  ÛÛÛÛÛÛÛÛÛÛÛÛÛ    ÛÛÛÛÛÛ 
 °ÛÛÛ   °ÛÛÛ   °ÛÛÛ  ÛÛÛ°°ÛÛÛ °ÛÛÛ  ÛÛÛ°°ÛÛÛ ÛÛÛ°°ÛÛÛ°°ÛÛÛ°°ÛÛÛ°°ÛÛÛ  ÛÛÛ°°ÛÛÛ
 °°ÛÛÛ  ÛÛÛÛÛ  ÛÛÛ  °ÛÛÛÛÛÛÛ  °ÛÛÛ °ÛÛÛ °°° °ÛÛÛ °ÛÛÛ °ÛÛÛ °ÛÛÛ °ÛÛÛ °ÛÛÛÛÛÛÛ 
  °°°ÛÛÛÛÛ°ÛÛÛÛÛ°   °ÛÛÛ°°°   °ÛÛÛ °ÛÛÛ  ÛÛÛ°ÛÛÛ °ÛÛÛ °ÛÛÛ °ÛÛÛ °ÛÛÛ °ÛÛÛ°°°  
    °°ÛÛÛ °°ÛÛÛ     °°ÛÛÛÛÛÛ  ÛÛÛÛÛ°°ÛÛÛÛÛÛ °°ÛÛÛÛÛÛ  ÛÛÛÛÛ°ÛÛÛ ÛÛÛÛÛ°°ÛÛÛÛÛÛ 
     °°°   °°°       °°°°°°  °°°°°  °°°°°°   °°°°°°  °°°°° °°° °°°°°  °°°°°°  
     
  ÛÛÛÛÛ                 ÛÛÛÛÛ    ÛÛÛÛÛ              
 °°ÛÛÛ                 °°ÛÛÛ    °°ÛÛÛ               
 ÛÛÛÛÛÛÛ    ÛÛÛÛÛÛ     ÛÛÛÛÛÛÛ   °ÛÛÛÛÛÛÛ    ÛÛÛÛÛÛ 
°°°ÛÛÛ°    ÛÛÛ°°ÛÛÛ   °°°ÛÛÛ°    °ÛÛÛ°°ÛÛÛ  ÛÛÛ°°ÛÛÛ
  °ÛÛÛ    °ÛÛÛ °ÛÛÛ     °ÛÛÛ     °ÛÛÛ °ÛÛÛ °ÛÛÛÛÛÛÛ 
  °ÛÛÛ ÛÛÛ°ÛÛÛ °ÛÛÛ     °ÛÛÛ ÛÛÛ °ÛÛÛ °ÛÛÛ °ÛÛÛ°°°  
  °°ÛÛÛÛÛ °°ÛÛÛÛÛÛ      °°ÛÛÛÛÛ  ÛÛÛÛ ÛÛÛÛÛ°°ÛÛÛÛÛÛ 
   °°°°°   °°°°°°        °°°°°  °°°° °°°°°  °°°°°°  


   ÛÛÛÛÛÛÛÛÛ                     ÛÛÛ                     
  ÛÛÛ°°°°°ÛÛÛ                   °°°                      
 ÛÛÛ     °°°   ÛÛÛÛÛÛ    ÛÛÛÛÛ  ÛÛÛÛ  ÛÛÛÛÛÛÛÛ    ÛÛÛÛÛÛ 
°ÛÛÛ          °°°°°ÛÛÛ  ÛÛÛ°°  °°ÛÛÛ °°ÛÛÛ°°ÛÛÛ  ÛÛÛ°°ÛÛÛ
°ÛÛÛ           ÛÛÛÛÛÛÛ °°ÛÛÛÛÛ  °ÛÛÛ  °ÛÛÛ °ÛÛÛ °ÛÛÛ °ÛÛÛ
°°ÛÛÛ     ÛÛÛ ÛÛÛ°°ÛÛÛ  °°°°ÛÛÛ °ÛÛÛ  °ÛÛÛ °ÛÛÛ °ÛÛÛ °ÛÛÛ
 °°ÛÛÛÛÛÛÛÛÛ °°ÛÛÛÛÛÛÛÛ ÛÛÛÛÛÛ  ÛÛÛÛÛ ÛÛÛÛ ÛÛÛÛÛ°°ÛÛÛÛÛÛ 
  °°°°°°°°°   °°°°°°°° °°°°°°  °°°°° °°°° °°°°°  °°°°°°  
                                                                                                               
MENU
    puts welcome_screen.colorize(:cyan)
    puts "Please tell us about yourself"
    puts "What is your name?"
    @name = gets.strip
    puts "how much is in your wallet?"
    @wallet = gets.strip.to_i
    puts "Welcome #{@name}, you have $#{@wallet} in your wallet."
    puts "Good Luck!".colorize(:green)
  end
end

 



